# 직접 해보세요!
## 시리즈와 데이터프레임 직접 만들기(51쪽)
### 1. 시리즈 만들기

In [1]:
import pandas as pd
s = pd.Series(['banana', 42])
print(s)#최상위 객체인 object로 dtype이 나옴

0    banana
1        42
dtype: object

In [3]:
s = pd.Series(['Wes McKinney', 'Creator of Pandas'])
print(s)

0         Wes McKinney
1    Creator of Pandas
dtype: object

In [4]:
s = pd.Series(['Wes McKinney', 'Creator of Pandas'], index=['Person', 'Who'])#index 명 지정하기
print(s)

Person         Wes McKinney
Who       Creator of Pandas
dtype: object

### 3. 데이터프레임 만들기

In [5]:
scientists = pd.DataFrame({ 
    'Name': ['Rosaline Franklin', 'William Gosset'], 
    'Occupation': ['Chemist', 'Statistician'], 
    'Born': ['1920-07-25', '1876-06-13'], 
    'Died': ['1958-04-16', '1937-10-16'], 
    'Age': [37, 61]}) 
scientists

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

In [6]:
scientists = pd.DataFrame( 
    data={'Occupation': ['Chemist', 'Statistician'], 
          'Born': ['1920-07-25', '1876-06-13'], 
          'Died': ['1958-04-16', '1937-10-16'],
          'Age': [37, 61]},
    index=['Rosaline Franklin', 'William Gosset'],#index 명 지정
    columns=['Occupation', 'Born', 'Age', 'Died']) #column 명 지정
scientists

                     Occupation        Born  Age        Died
Rosaline Franklin       Chemist  1920-07-25   37  1958-04-16
William Gosset     Statistician  1876-06-13   61  1937-10-16

In [9]:
from collections import OrderedDict

scientists = pd.DataFrame(OrderedDict([ 
    ('Name', ['Rosaline Franklin', 'William Gosset']),# 한개의 dictionary는 1개의 열을 구성, key= 열의 이름, values는 열의 내용
    ('Occupation', ['Chemist', 'Statistician']), # 각 리스트의 성분은 행을 구성 
    ('Born', ['1920-07-25', '1876-06-13']), # 리스트의 갯수는 맞춰주어야 함
    ('Died', ['1958-04-16', '1937-10-16']), 
    ('Age', [37, 61])
])
) 
scientists

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

# 직접 해보세요!
## 데이터프레임에서 시리즈 선택하기(54쪽)

In [11]:
scientists = pd.DataFrame(
    data={'Occupation': ['Chemist', 'Statistician'], 
          'Born': ['1920-07-25', '1876-06-13'], 
          'Died': ['1958-04-16', '1937-10-16'],
          'Age': [37, 61]},
    index=['Rosaline Franklin', 'William Gosset'],
    columns=['Occupation', 'Born', 'Died', 'Age'])

In [12]:
first_row = scientists.loc['William Gosset'] # 하나의 행 또는 열을 취했을 경우 Series
print(type(first_row))

<class 'pandas.core.series.Series'>

In [13]:
first_row

Occupation    Statistician
Born            1876-06-13
Died            1937-10-16
Age                     61
Name: William Gosset, dtype: object

# 직접 해보세요!
## index, values 속성과 keys 메서드 사용하기(55쪽)

### 1. index 속성 사용하기

In [14]:
print(first_row.index)

Index(['Occupation', 'Born', 'Died', 'Age'], dtype='object')

### 2. values 속성 사용하기

In [15]:
print(first_row.values)#numpy의 array

['Statistician' '1876-06-13' '1937-10-16' 61]

### 3. keys 메서드 사용하기

In [16]:
print(first_row.keys())

Index(['Occupation', 'Born', 'Died', 'Age'], dtype='object')

### 4. index 속성 응용하기

In [17]:
print(first_row.index[0])

Occupation

In [29]:
print(first_row.index[:2])

Index(['Occupation', 'Born'], dtype='object')

### 5. keys 메서드와 index 속성 응용하기

In [18]:
print(first_row.keys()[0])

Occupation

In [30]:
first_row[['Occupation','Age']]# fancy 색인

Occupation    Statistician
Age                     61
Name: William Gosset, dtype: object

In [32]:
first_row.index[0:3]

Index(['Occupation', 'Born', 'Died'], dtype='object')

# 직접 해보세요!
## 시리즈의 mean, min, max, std 메서드 사용하기(56쪽)

In [19]:
ages = scientists['Age'] 
print(ages)

Rosaline Franklin    37
William Gosset       61
Name: Age, dtype: int64

In [20]:
print(ages.mean())

49.0

In [21]:
print(ages.min())

37

In [22]:
print(ages.max())

61

In [23]:
print(ages.std())

16.97056274847714

# 직접 해보세요!
## 시리즈와 불린 추출 사용하기(59쪽)

In [33]:
scientists = pd.read_csv('../data/scientists.csv')
scientists

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [35]:
ages = scientists['Age'] 
print(ages)
print(ages.max())

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64
90

In [26]:
print(ages.mean())

59.125

In [27]:
print(ages[ages > ages.mean()])

1    61
2    90
3    66
7    77
Name: Age, dtype: int64

In [28]:
print(ages > ages.mean())

0    False
1     True
2     True
3     True
4    False
5    False
6    False
7     True
Name: Age, dtype: bool

In [10]:
print(type(ages > ages.mean()))

<class 'pandas.core.series.Series'>

In [11]:
manual_bool_values = [True, True, False, False, True, True, False, True] 
print(ages[manual_bool_values])

0    37
1    61
4    56
5    45
7    77
Name: Age, dtype: int64

In [37]:
ages[ages>ages.mean()].reset_index()

   index  Age
0      1   61
1      2   90
2      3   66
3      7   77

In [38]:
ages[ages>ages.mean()].reset_index(drop=True)# 기존 index 값 초기화

0    61
1    90
2    66
3    77
Name: Age, dtype: int64

# 직접 해보세요!
## 벡터와 스칼라로 브로드캐스팅 수행하기(61쪽)

In [12]:
print(ages + ages)# colum 과 row 명이 동일하면 연산 수행

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [39]:
ages[:4] + ages[-4:]# 해당 항목별 값이 없으면 않으면 결치값

0   NaN
1   NaN
2   NaN
3   NaN
4   NaN
5   NaN
6   NaN
7   NaN
Name: Age, dtype: float64

In [41]:
ages[:4].add(ages[-4:], fill_value=0)# 결치값을 0으로 치환하여 연산 수행

0    37.0
1    61.0
2    90.0
3    66.0
4    56.0
5    45.0
6    41.0
7    77.0
Name: Age, dtype: float64

In [42]:
ages[:4].multiply(ages[-4:], fill_value=1)# 결치값을 0으로 치환하여 연산 수행

0    37.0
1    61.0
2    90.0
3    66.0
4    56.0
5    45.0
6    41.0
7    77.0
Name: Age, dtype: float64

In [13]:
print(ages * ages)

0    1369
1    3721
2    8100
3    4356
4    3136
5    2025
6    1681
7    5929
Name: Age, dtype: int64

In [14]:
print(ages + 100)# 모든 성분에 대하여 100을 더해줌

0    137
1    161
2    190
3    166
4    156
5    145
6    141
7    177
Name: Age, dtype: int64

In [15]:
print(ages * 2)

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [16]:
print(pd.Series([1, 100]))

0      1
1    100
dtype: int64

In [17]:
print(ages + pd.Series([1, 100]))

0     38.0
1    161.0
2      NaN
3      NaN
4      NaN
5      NaN
6      NaN
7      NaN
dtype: float64

In [18]:
rev_ages = ages.sort_index(ascending=False)# 값을 거꾸로 입력 
print(rev_ages)

7    77
6    41
5    45
4    56
3    66
2    90
1    61
0    37
Name: Age, dtype: int64

In [19]:
print(ages * 2)

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [20]:
print(ages + rev_ages)

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [44]:
[1,2,3]+3

TypeError: can only concatenate list (not "int") to list

In [45]:
[1,2,3]+[3] # append 와 동일

[1, 2, 3, 3]

In [47]:
[1,2,3]*3

[1, 2, 3, 1, 2, 3, 1, 2, 3]

In [48]:
array([1,2,3])+3

array([4, 5, 6])

In [49]:
array([1,2,3])*3

array([3, 6, 9])

# 직접 해보세요!
## 불린 추출과 브로드캐스팅(65쪽)

In [21]:
print(scientists[scientists['Age'] > scientists['Age'].mean()])

                   Name        Born        Died  Age     Occupation
1        William Gosset  1876-06-13  1937-10-16   61   Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90          Nurse
3           Marie Curie  1867-11-07  1934-07-04   66        Chemist
7          Johann Gauss  1777-04-30  1855-02-23   77  Mathematician

In [22]:
print(scientists.loc[[True, True, False, True]])

                Name        Born        Died  Age    Occupation
0  Rosaline Franklin  1920-07-25  1958-04-16   37       Chemist
1     William Gosset  1876-06-13  1937-10-16   61  Statistician
3        Marie Curie  1867-11-07  1934-07-04   66       Chemist

In [38]:
print(scientists * 2)

                                       Name                  Born  \
0        Rosaline FranklinRosaline Franklin  1920-07-251920-07-25
1              William GossetWilliam Gosset  1876-06-131876-06-13
2  Florence NightingaleFlorence Nightingale  1820-05-121820-05-12
3                    Marie CurieMarie Curie  1867-11-071867-11-07
4                Rachel CarsonRachel Carson  1907-05-271907-05-27
5                        John SnowJohn Snow  1813-03-151813-03-15
6                    Alan TuringAlan Turing  1912-06-231912-06-23
7                  Johann GaussJohann Gauss  1777-04-301777-04-30

                   Died  Age                            Occupation
0  1958-04-161958-04-16   74                        ChemistChemist
1  1937-10-161937-10-16  122              StatisticianStatistician
2  1910-08-131910-08-13  180                            NurseNurse
3  1934-07-041934-07-04  132                        ChemistChemist
4  1964-04-141964-04-14  112                    BiologistBiologist
5  1858-06-161858-06-16   90                    PhysicianPhysician
6  1954-06-071954-06-07   82  Computer ScientistComputer Scientist
7  1855-02-231855-02-23  154            MathematicianMathematician

In [75]:
pd.concat([scientists]*2 ,axis=0,ignore_index=True)
# scientists.append(scientists)# 수직결합

                    Name        Born        Died  Age          Occupation
0      Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1         William Gosset  1876-06-13  1937-10-16   61        Statistician
2   Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3            Marie Curie  1867-11-07  1934-07-04   66             Chemist
4          Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5              John Snow  1813-03-15  1858-06-16   45           Physician
6            Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7           Johann Gauss  1777-04-30  1855-02-23   77       Mathematician
8      Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
9         William Gosset  1876-06-13  1937-10-16   61        Statistician
10  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
11           Marie Curie  1867-11-07  1934-07-04   66             Chemist
12         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
13             John Snow  1813-03-15  1858-06-16   45           Physician
14           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
15          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [72]:
pd.concat([scientists,scientists], axis=1,sort=False)# 수평 결합

,Name,Born,Died,Age,Occupation,Name,Born,Died,Age,Occupation
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,William Gosset,1876-06-13,1937-10-16,61,Statistician
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,Marie Curie,1867-11-07,1934-07-04,66,Chemist
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,Rachel Carson,1907-05-27,1964-04-14,56,Biologist
5,John Snow,1813-03-15,1858-06-16,45,Physician,John Snow,1813-03-15,1858-06-16,45,Physician
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician

In [128]:
pd.merge(scientists,scientists, how = 'outer',left_index=True, right_index=True)

,Name_x,Born_x,Died_x,Age_x,Occupation_x,Name_y,Born_y,Died_y,Age_y,Occupation_y
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,William Gosset,1876-06-13,1937-10-16,61,Statistician
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,Marie Curie,1867-11-07,1934-07-04,66,Chemist
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,Rachel Carson,1907-05-27,1964-04-14,56,Biologist
5,John Snow,1813-03-15,1858-06-16,45,Physician,John Snow,1813-03-15,1858-06-16,45,Physician
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician

In [132]:
pd.merge(scientists,scientists, how = 'outer',on="Name")

,Name,Born_x,Died_x,Age_x,Occupation_x,Born_y,Died_y,Age_y,Occupation_y
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25,1958-04-16,37,Chemist
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,1876-06-13,1937-10-16,61,Statistician
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12,1910-08-13,90,Nurse
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,1867-11-07,1934-07-04,66,Chemist
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-05-27,1964-04-14,56,Biologist
5,John Snow,1813-03-15,1858-06-16,45,Physician,1813-03-15,1858-06-16,45,Physician
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,1912-06-23,1954-06-07,41,Computer Scientist
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,1777-04-30,1855-02-23,77,Mathematician

In [135]:
pd.merge(scientists.T,scientists.T, how = 'outer',left_index=True, right_index=True).T.reset_index(drop=True)

                    Name        Born        Died Age          Occupation
0      Rosaline Franklin  1920-07-25  1958-04-16  37             Chemist
1         William Gosset  1876-06-13  1937-10-16  61        Statistician
2   Florence Nightingale  1820-05-12  1910-08-13  90               Nurse
3            Marie Curie  1867-11-07  1934-07-04  66             Chemist
4          Rachel Carson  1907-05-27  1964-04-14  56           Biologist
5              John Snow  1813-03-15  1858-06-16  45           Physician
6            Alan Turing  1912-06-23  1954-06-07  41  Computer Scientist
7           Johann Gauss  1777-04-30  1855-02-23  77       Mathematician
8      Rosaline Franklin  1920-07-25  1958-04-16  37             Chemist
9         William Gosset  1876-06-13  1937-10-16  61        Statistician
10  Florence Nightingale  1820-05-12  1910-08-13  90               Nurse
11           Marie Curie  1867-11-07  1934-07-04  66             Chemist
12         Rachel Carson  1907-05-27  1964-04-14  56           Biologist
13             John Snow  1813-03-15  1858-06-16  45           Physician
14           Alan Turing  1912-06-23  1954-06-07  41  Computer Scientist
15          Johann Gauss  1777-04-30  1855-02-23  77       Mathematician

# 직접 해보세요!
## 시리즈와 데이터프레임의 데이터 처리하기(67쪽)

In [137]:
print(scientists['Born'].dtype)
print(scientists['Died'].dtype)

object
object

In [140]:
scientists['Born'][0]

'1920-07-25'

In [141]:
born_datetime = pd.to_datetime(scientists['Born'], format='%Y-%m-%d') 
print(born_datetime)

0   1920-07-25
1   1876-06-13
2   1820-05-12
3   1867-11-07
4   1907-05-27
5   1813-03-15
6   1912-06-23
7   1777-04-30
Name: Born, dtype: datetime64[ns]

In [168]:
born_datetime.year

AttributeError: 'Series' object has no attribute 'year'

In [142]:
died_datetime = pd.to_datetime(scientists['Died'], format='%Y-%m-%d')
print(died_datetime)

0   1958-04-16
1   1937-10-16
2   1910-08-13
3   1934-07-04
4   1964-04-14
5   1858-06-16
6   1954-06-07
7   1855-02-23
Name: Died, dtype: datetime64[ns]

In [143]:
scientists['born_dt'], scientists['died_dt'] = (born_datetime, died_datetime)
print(scientists.head())

                   Name        Born        Died  Age    Occupation    born_dt  \
0     Rosaline Franklin  1920-07-25  1958-04-16   37       Chemist 1920-07-25
1        William Gosset  1876-06-13  1937-10-16   61  Statistician 1876-06-13
2  Florence Nightingale  1820-05-12  1910-08-13   90         Nurse 1820-05-12
3           Marie Curie  1867-11-07  1934-07-04   66       Chemist 1867-11-07
4         Rachel Carson  1907-05-27  1964-04-14   56     Biologist 1907-05-27

     died_dt
0 1958-04-16
1 1937-10-16
2 1910-08-13
3 1934-07-04
4 1964-04-14

In [146]:
print(scientists.shape)

(8, 7)

In [147]:
scientists['age_days_dt'] = (scientists['died_dt'] - \
                             scientists['born_dt'])
print(scientists)

                   Name        Born        Died  Age          Occupation  \
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

     born_dt    died_dt age_days_dt
0 1920-07-25 1958-04-16  13779 days
1 1876-06-13 1937-10-16  22404 days
2 1820-05-12 1910-08-13  32964 days
3 1867-11-07 1934-07-04  24345 days
4 1907-05-27 1964-04-14  20777 days
5 1813-03-15 1858-06-16  16529 days
6 1912-06-23 1954-06-07  15324 days
7 1777-04-30 1855-02-23  28422 days

### 5. 시리즈, 데이터프레임의 데이터 섞기

In [148]:
print(scientists['Age'])

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64

In [47]:
import random

random.seed(42)
random.shuffle(scientists['Age'])
print(scientists['Age'])

C:\Users\fermat39\Anaconda3\lib\random.py:275: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  x[i], x[j] = x[j], x[i]

0    66
1    56
2    41
3    77
4    90
5    45
6    37
7    61
Name: Age, dtype: int64

### 7. 데이터프레임의 열 삭제하기

In [48]:
print(scientists.columns)

Index(['Name', 'Born', 'Died', 'Age', 'Occupation', 'born_dt', 'died_dt',
       'age_days_dt'],
      dtype='object')

In [49]:
scientists_dropped = scientists.drop(['Age'], axis=1)

print(scientists_dropped.columns)

Index(['Name', 'Born', 'Died', 'Occupation', 'born_dt', 'died_dt',
       'age_days_dt'],
      dtype='object')

# 직접 해보세요!
## 데이터를 피클, CSV, TSV 파일로 저장하고 불러오기(72쪽)

### 1. 피클로 저장하기

In [19]:
names = scientists['Name']

In [20]:
names.to_pickle('../output/scientists_names_series.pickle')

In [21]:
scientists.to_pickle('../output/scientists_df.pickle')

In [53]:
scientist_names_from_pickle = pd.read_pickle('../output/scientists_names_series.pickle')
print(scientist_names_from_pickle)

0       Rosaline Franklin
1          William Gosset
2    Florence Nightingale
3             Marie Curie
4           Rachel Carson
5               John Snow
6             Alan Turing
7            Johann Gauss
Name: Name, dtype: object

In [54]:
scientists_from_pickle = pd.read_pickle('../output/scientists_df.pickle')
print(scientists_from_pickle)

                   Name        Born        Died  Age          Occupation  \
0     Rosaline Franklin  1920-07-25  1958-04-16   66             Chemist
1        William Gosset  1876-06-13  1937-10-16   56        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   41               Nurse
3           Marie Curie  1867-11-07  1934-07-04   77             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   90           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   37  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   61       Mathematician

     born_dt    died_dt age_days_dt
0 1920-07-25 1958-04-16  13779 days
1 1876-06-13 1937-10-16  22404 days
2 1820-05-12 1910-08-13  32964 days
3 1867-11-07 1934-07-04  24345 days
4 1907-05-27 1964-04-14  20777 days
5 1813-03-15 1858-06-16  16529 days
6 1912-06-23 1954-06-07  15324 days
7 1777-04-30 1855-02-23  28422 days

### 4. CSV 파일과 TSV 파일로 저장하기

In [55]:
names.to_csv('../output/scientist_names_series.csv')

In [56]:
scientists.to_csv('../output/scientists_df.tsv', sep='\t')

In [57]:
scientists.to_csv('../output/scientists_df_no_index.csv', index=False)

In [58]:
names_df = names.to_frame()

import xlwt 
names_df.to_excel('../output/scientists_names_series_df.xls')

import openpyxl 
names_df.to_excel('../output/scientists_names_series_df.xlsx')